publish/add-form-field-to-pdf.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>往 PDF 上添加 form field</title>
<meta name="author" content="Spike Leung" />
<meta name="description" content="&quot;&quot;" />
<meta name="generator" content="Org Mode" />

<link rel="stylesheet" href="https://chinese-fonts-cdn.deno.dev/packages/lxgwwenkai/dist/LXGWWenKai-Bold/result.css" />
<link rel="stylesheet" href="https://chinese-fonts-cdn.deno.dev/packages/lxgwwenkai/dist/LXGWWenKai-Regular/result.css" />
<link rel="stylesheet" href="../styles/style.css" type="text/css"/>
<link rel="icon" href="/favicon.ico" type="image/x-icon">
</head>
<body>
<div id="preamble" class="status">

 <nav>
  <ul>
    <li><a href="/index.html">Home</a></li>
    <li><a href="/about.html">About</a></li>
    <li><a href="/rss.xml">RSS</a></li>
    <li><a href="https://github.com/Spike-Leung/taxodium/tree/org-publish">GitHub</a></li>
    <li><a href="https://music.163.com/#/playlist?id=12531191848">Playlist</a></li>
    <li><a href="/_blank.html">_blank</a></li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">往 PDF 上添加 form field</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0835e02">前言</a></li>
<li><a href="#org881280f">如何将 PDF 渲染出来</a></li>
<li><a href="#org66b3483">如何将字段放到 PDF 上对应的位置</a></li>
<li><a href="#orgd0386b8">字段如何写入到 PDF 中</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org0835e02" class="outline-2">
<h2 id="org0835e02">前言</h2>
<div class="outline-text-2" id="text-org0835e02">
<p>
前阵子需要实现一个需求：
</p>

<p>
拿到一份原始的 PDF，PDF 上会有一些空需要填充字段，需要用户自己去选择字段，放到对应位置，生成携带字段的 PDF。
</p>

<p>
生成的 PDF 再给后端解析，填充实际的字段值，生成得到一份带有实际值的 PDF。
</p>

<p>
实现之初碰到几个难点：
</p>

<ul class="org-ul">
<li>如何将 PDF 渲染出来</li>

<li>如何将字段放到 PDF 上对应的位置</li>

<li>字段如何写入到 PDF 中</li>
</ul>
</div>
</div>

<div id="outline-container-org881280f" class="outline-2">
<h2 id="org881280f">如何将 PDF 渲染出来</h2>
<div class="outline-text-2" id="text-org881280f">
<p>
我想这类需求，应该别人也碰到过，说不定有现成的方案，果不其然，找到了 <a href="https://github.com/ShizukuIchi/pdf-editor">pdf-editor</a> 这个仓库。
</p>

<p>
渲染的思路是：
</p>

<ul class="org-ul">
<li>用 <a href="https://github.com/mozilla/pdf.js">pdf.js</a> 去解析 PDF 文件，得到一个解析后的 PDF 对象，通过它可以得到 PDF 的每一页</li>
</ul>


<ul class="org-ul">
<li>接着用 Canvas 去将每一页 PDF 画出来，可以参考官方的 <a href="https://mozilla.github.io/pdf.js/examples/">Hello World Walkthrough</a>。</li>
</ul>

<p>
这样就完成了 PDF 的渲染。
</p>

<p>
在使用 pdf.js 的时候，由于实际开发的技术栈比较旧，不支持 ES6 的一些语法，配置和调整 babel 也没整明白，还需要升级 NodeJS 版本。
</p>

<p>
虽然官方提供了 Legend biuld，但依然是包含了不支持的语法，甚至提了一个 <a href="https://github.com/mozilla/pdf.js/issues/17082">issue</a> 去问。
</p>

<p>
后来是一直降低 pdf.js 的版本，下了一个和 <a href="https://github.com/ShizukuIchi/pdf-editor">pdf-editor</a> 一样的版本 (2.3.2)，终于是能集成到项目了。
</p>

<p>
所幸功能基本够用。
</p>
</div>
</div>

<div id="outline-container-org66b3483" class="outline-2">
<h2 id="org66b3483">如何将字段放到 PDF 上对应的位置</h2>
<div class="outline-text-2" id="text-org66b3483">
<p>
可以参考 <a href="https://github.com/ShizukuIchi/pdf-editor">pdf-editor</a> 的实现，也可以使用 <a href="https://developer.mozilla.org/en-US/docs/Web/API/HTML_Drag_and_Drop_API/Drag_operations#draggableattribute">Drag and Drop API</a> 将需要的元素拖拽到 PDF 上。
</p>

<p>
我的实现思路是：
</p>

<ul class="org-ul">
<li>将每一页 PDF 看作一个容器，设置 <code>position: relative;</code></li>
</ul>


<ul class="org-ul">
<li>通过 <a href="https://developer.mozilla.org/en-US/docs/Web/API/HTML_Drag_and_Drop_API/Drag_operations#draggableattribute">Drag and Drop API</a> 将字段元素，拖拽到对应的页上，计算对应的 x，y 坐标，设置 <code>positon: absolute;</code> ，这样元素就能相对每一页的 PDF 定位。
在实现时，借助 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Element/getBoundingClientRect">getBoundingClientRect()</a> 以及鼠标事件返回的位置，可以很容易的计算到 x，y。</li>
</ul>


<ul class="org-ul">
<li>接着将拖拽到 PDF 上的元素，以二维数组的形式存储， 数组元素对应每一页包含的字段。</li>
</ul>

<p>
实现的时候，碰到一个问题，当将元素拖拽到和自身重合的时候，会导致位置计算错误，元素被挪动到页面的左上角。
</p>

<p>
原因是我基于 <a href="https://developer.mozilla.org/en-US/docs/Web/API/HTMLElement/drop_event">drop 事件</a> 返回的 target 计算 x，y，而我实际的 target 应该是对应的 PDF 页容器。
</p>

<p>
因此，只需要找到对应的 PDF 页元素作为 target，再使用 <a href="https://developer.mozilla.org/en-US/docs/Web/API/Element/getBoundingClientRect">getBoundingClientRect()</a> 去计算一个准确的 x，y 就能解决了。
</p>
</div>
</div>

<div id="outline-container-orgd0386b8" class="outline-2">
<h2 id="orgd0386b8">字段如何写入到 PDF 中</h2>
<div class="outline-text-2" id="text-orgd0386b8">
<p>
经过上面两步，现在有一个数组，包含 PDF 的每一页。
</p>

<p>
另一个数组，包含每一页上的字段信息(坐标，宽度，及其他值)。
</p>

<p>
两个数组的下标是一一对应的。
</p>

<p>
只需要遍历其中一个数组，使用 <a href="https://github.com/Hopding/pdf-lib">pdf-lib</a> 这个库，就可以将元素写入到 PDF 中。
</p>

<p>
这里我是用 <a href="https://pdf-lib.js.org/docs/api/classes/pdfform#createtextfield">createTextField</a> API 添加字段，后端可以根据字段的 id 找到对应的字段，得到字段信息 (x, y, id 等)。
</p>

<p>
需要注意的是，使用 createTextField 生成的 text field 自带一个白色背景，可能会覆盖 PDF 的文字。
</p>

<p>
参考 <a href="https://github.com/Hopding/pdf-lib/issues/605">[Feature Request] Transparent Fields #605</a>，将 backgroundColor 和 borderColor 置为 undefined 就好了。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">

<p class="author">Author: <a href="mailto:l-yanlei@hotmail.com">Spike Leung</a></p>
<p class="date">Date: 2023-10-23 Mon 00:00</p>
<p class="license">License: <a href="https://www.creativecommons.org/licenses/by-nc/4.0/deed.zh-hans">CC BY-NC 4.0</a></p>
<script src="https://giscus.app/client.js"
        data-repo="Spike-Leung/taxodium"
        data-repo-id="MDEwOlJlcG9zaXRvcnkzOTYyNDQwMzk="
        data-category="Announcements"
        data-category-id="DIC_kwDOF540R84Ci61D"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="top"
        data-theme="light_high_contrast"
        data-lang="en"
        data-loading="lazy"
        crossorigin="anonymous"
        async>
</script>
</div>
</body>
</html>
